// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ErrStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell err command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_ERR_EFI_ERROR              #language eng  "%EEFI ERROR%H %08x %N\n"

#string STR_ERR_EFI_D_INIT             #language eng  "%H  %08x  EFI_D_INIT%N\n"

#string STR_ERR_EFI_D_INIT_2           #language eng  "  %08x  EFI_D_INIT\n"

#string STR_ERR_EFI_D_WARN             #language eng  "%H  %08x  EFI_D_WARN%N\n"

#string STR_ERR_EFI_D_WARN_2           #language eng  "  %08x  EFI_D_WARN\n"

#string STR_ERR_EFI_D_LOAD             #language eng  "%H  %08x  EFI_D_LOAD%N\n"

#string STR_ERR_EFI_D_LOAD_2           #language eng  "  %08x  EFI_D_LOAD\n"

#string STR_ERR_EFI_D_FS               #language eng  "%H  %08x  EFI_D_FS%N\n"

#string STR_ERR_EFI_D_FS_2             #language eng  "  %08x  EFI_D_FS\n"

#string STR_ERR_EFI_D_POOL             #language eng  "%H  %08x  EFI_D_POOL%N\n"

#string STR_ERR_EFI_D_POOL_2           #language eng  "  %08x  EFI_D_POOL\n"

#string STR_ERR_EFI_D_PAGE             #language eng  "%H  %08x  EFI_D_PAGE%N\n"

#string STR_ERR_EFI_D_PAGE_2           #language eng  "  %08x  EFI_D_PAGE\n"

#string STR_ERR_EFI_D_INFO             #language eng  "%H  %08x  EFI_D_INFO%N\n"

#string STR_ERR_EFI_D_INFO_2           #language eng  "  %08x  EFI_D_INFO\n"

#string STR_ERR_EFI_D_VARIABLE         #language eng  "%H  %08x  EFI_D_VARIABLE%N\n"

#string STR_ERR_EFI_D_VARIABLE_2       #language eng  "  %08x  EFI_D_VARIABLE\n"

#string STR_ERR_EFI_D_BM               #language eng  "%H  %08x  EFI_D_BM%N\n"

#string STR_ERR_EFI_D_BM_2             #language eng  "  %08x  EFI_D_BM\n"

#string STR_ERR_EFI_D_BLKIO            #language eng  "%H  %08x  EFI_D_BLKIO%N\n"

#string STR_ERR_EFI_D_BLKIO_2          #language eng  "  %08x  EFI_D_BLKIO\n"

#string STR_ERR_EFI_D_NET              #language eng  "%H  %08x  EFI_D_NET%N\n"

#string STR_ERR_EFI_D_NET_2            #language eng  "  %08x  EFI_D_NET\n"

#string STR_ERR_EFI_D_UNDI             #language eng  "%H  %08x  EFI_D_UNDI%N\n"

#string STR_ERR_EFI_D_UNDI_2           #language eng  "  %08x  EFI_D_UNDI\n"

#string STR_ERR_EFI_D_LOADFILE         #language eng  "%H  %08x  EFI_D_LOADFILE%N\n"

#string STR_ERR_EFI_D_LOADFILE_2       #language eng  "  %08x  EFI_D_LOADFILE\n"

#string STR_ERR_EFI_D_EVENT            #language eng  "%H  %08x  EFI_D_EVENT%N\n"

#string STR_ERR_EFI_D_EVENT_2          #language eng  "  %08x  EFI_D_EVENT\n"

#string STR_ERR_EFI_D_ERROR            #language eng  "%H  %08x  EFI_D_ERROR%N\n"

#string STR_ERR_EFI_D_ERROR_2          #language eng  "  %08x  EFI_D_ERROR\n"

#string STR_ERR_WRITE_TO_NV	       #language eng  "Make this change and save to NVRAM? [Y/N]"

#string STR_ERR_SYNTAX_ERROR_HELP      #language eng  "%Herr%N: Syntax error, please refer to 'err -?'\n"

#string STR_ERR_LINEHELP      #language eng  "Displays or changes the error level"

#string STR_ERR_DUMP_DRV_DEBUG_MASK    #language eng  "%8x: %08x\n"

#string STR_ERR_TITLE                  #language eng  "%H Handle     Mask  \n========  ========%N\n"

#string STR_ERR_CAN_NOT_DUMP_HANDLE    #language eng  "%Herr%N: Can not dump the debug mask information on %hx.\n"

#string STR_ERR_SET_ERROR              #language eng  "%Herr%N: Can not set debug mask of handle %hx to %hx.\n"

#string STR_ERR_NO_HANDLE              #language eng  "%Herr%N: No handle with debug mask protocol found!\n"

#string STR_ERR_HANDLE_NOT_FOUND       #language eng  "%Herr%N: Can not find debug mask protocol on handle %H0x%N%hx.\n"

#string STR_ERR_VERBOSEHELP   #language eng  "Displays or changes the error level in the system.\n"
                                                      "\n"
                                                      "ERR [ErrorLevel]\n"
                                                      "ERR -dump [Handle]\n"
                                                      "ERR Handle ErrorLevel\n"
                                                      "\n"
                                                      "    ErrorLevel   - New error level bit mask.\n"
                                                      "    -dump        - Dump debug mask of all or specified handle.\n"
                                                      "    Handle       - Driver's handle.\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. In debug version, the message whose error level is higher than this\n"
                                                      "       level will be displayed.\n"
                                                      "    2. Saving to NVRAM will cause the error level to be saved and used on all\n"
                                                      "       future reboots. Core of EFI will use the new error level as system is\n"
                                                      "       booting (all core EFI routines will then output using the new error\n"
                                                      "       level).\n"
                                                      "    3. Error console must be set to a device path (ie com port or console).\n"
                                                      "       This is typically done in the boot manager, boot option maintenance\n"
                                                      "       menu. Active Standard Error Devices menu. Not all EFI implementations\n"
                                                      "       include an error console or support debug output. Consult the BIOS\n"
                                                      "       release notes for this support.\n"
                                                      "    4. To add your own errors/error level see debug macro in sample\n"
                                                      "       implementation source in efidebug.h.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the current error message output level:\n"
                                                      "    Shell> err\n"
                                                      "    EFI ERROR 80000000\n"
                                                      "      00000001  EFI_D_INIT\n"
                                                      "      00000002  EFI_D_WARN\n"
                                                      "      00000004  EFI_D_LOAD\n"
                                                      "      00000008  EFI_D_FS\n"
                                                      "      00000010  EFI_D_POOL\n"
                                                      "      00000020  EFI_D_PAGE\n"
                                                      "      00000040  EFI_D_INFO\n"
                                                      "      00000100  EFI_D_VARIABLE\n"
                                                      "      00000400  EFI_D_BM\n"
                                                      "      00001000  EFI_D_BLKIO\n"
                                                      "      00004000  EFI_D_NET\n"
                                                      "      00010000  EFI_D_UNDI\n"
                                                      "      00020000  EFI_D_LOADFILE\n"
                                                      "      00080000  EFI_D_EVENT\n"
                                                      "%H      80000000  EFI_D_ERROR%N\n"
                                                      "\n"
                                                      "  * To change the error message output level:\n"    
                                                      "    Shell> err 80000107\n"    
                                                      "    Make this change and save to NVRAM? [Y/N]y\n"
                                                      "\n" 
                                                      "    Shell> _\n" 
                                                      "\n"
                                                      "  * To dump the debug mask of all handles which support debug mask protocol:\n"
                                                      "    Shell> err -dump\n"
                                                      "     Handle     Mask\n"
                                                      "    ========  ========\n" 
                                                      "           1: 80000004\n"
                                                      "           9: 80000004\n"
                                                      "           B: 80000004\n"
                                                      "           D: 80000004\n"
                                                      "           F: 80000004\n"
                                                      "          11: 80000004\n"
                                                      "          13: 80000004\n"
                                                      "          45: 80000004\n"
                                                      "          62: 80000004\n"
                                                      "          63: 80000004\n"
                                                      "          64: 80000004\n"
                                                      "\n"
                                                      "  * To dump the debug mask of handle 0x13:\n"
                                                      "    Shell> err -dump 13\n"
                                                      "     Handle     Mask\n"
                                                      "    ========  ========\n" 
                                                      "          13: 80000004\n"
                                                      "\n"
                                                      "  * To change the debug mask of handle 0x13:\n"
                                                      "    Shell> err 13 80000007\n"
                                                      "\n"
                                                      "    Shell> _\n"                                                      
